{
  "page_title": "Quick Start",
  "page_description": "Create your first app on XION in less than 3 minutes",
  "step_1_title": "Step 1: Launch Your Contract",
  "step_1_description": "This will deploy a smart contract to the XION blockchain, create a treasury instance for this contract to fund transactions against it, and then makes a faucet transaction to fund the treasury.",
  "step_2_title": "Step 2: Choose a Frontend Template",
  "step_2_description": "Now that the contract is deployed, you can choose one of our ready-made frontend templates to interact with your contract.  You can choose between a web app or a mobile app.",
  "step_3_title": "Step 3: Configure Reclaim Protocol",
  "step_3_description": "Enter your Reclaim Protocol credentials to enable zkTLS proof verification in your application.",
  "step_4_title": "Step 4: Build Your Project",
  "step_4_description": "With your contract deployed and frontend template chosen, you can now build your project.  Either copy and paste the one-liner below into your terminal or select the Copy/Paste tab to copy the environment variables to paste into your .env file.",
  "step_5_title": "Step 5: Add Your Reclaim App Secret",
  "step_5_description": "For security, add your Reclaim App Secret directly to your .env.local file. Never commit this secret to version control.",
  "webapp_description": "A WebApp frontend for interacting with the JSON Store smart contract on the XION blockchain.",
  "webapp_template_url": "https://github.com/burnt-labs/xion-user-map-json-store-frontend",
  "mobile_description": "A mobile frontend for interacting with the JSON Store smart contract on the XION blockchain.",
  "mobile_template_url": "https://github.com/burnt-labs/abstraxion-expo-demo",
  "copypaste_box_default_text": "Once you've launched your contract, copy and paste the following into your .env.local file",
  "launch_button_text": {
    "default": "Launch User Map & Fund Treasury",
    "default_rum": "Launch RUM Contract & Fund Treasury", 
    "launched": "Already Launched ✓",
    "launching": "Launching..."
  },
  "tabs": {
    "one_liner": {
      "title": "One-liner (Recommended)",
      "subheading": "One-liner",
      "description": "Run this in your terminal to automatically clone the repository, set up the environment, and install dependencies:"
    },
    "manual": {
      "title": "Manual Setup",
      "subheading": "Manual Environment Setup",
      "description": "Already have the project cloned? Copy and paste the following into your .env.local file:"
    }
  }
}
